
Процедура ксп_ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Узел = ксп_ЭкспортСлужебныйПовтИсп.Константы_ксп_УзелОбменаRabbit();
	
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		
		ЗаписьЖурналаРегистрации("Экспорт_из_УТ_в_Rabbit", 
			УровеньЖурналаРегистрации.Предупреждение,,
			Источник.Ссылка,
			"Не установлена константа ксп_УзелОбменаRabbit в расширении КСП! Регистрация документа в плане обмена <Кодерлайн_интеграция> не выполнена!");
		Возврат;
	КонецЕсли;

	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Ссылка);
	
КонецПроцедуры