Процедура ксп_ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт

	Если Источник.обменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;


	Узел = ксп_ЭкспортСлужебныйПовтИсп.Константы_ксп_УзелОбменаRabbit();
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		
		ЗаписьЖурналаРегистрации("Экспорт_из_ЕРП", УровеньЖурналаРегистрации.Предупреждение,,Источник.Ссылка,
			"Не установлена константа ксп_УзелОбменаRabbit! Регистрация документа в плане обмена Кодерлайн_интеграция не выполнена!");
		Возврат;
	КонецЕсли;

	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Ссылка);
	
КонецПроцедуры